// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6

Console.WriteLine("Введите число");
int number = Convert.ToInt32(Console.ReadLine());
int hepNumber = number;

if (number < 100 && number > -100)
{
    Console.WriteLine("Третьей цифры нет");
}
else 
    while (helpNumber < 1000)
        helpNumber = helpNumber / 10;

Console.WriteLine(bit);
int helpNumber = helpNumber % 100;       
Console.WriteLine(helpNumber);